<!DOCTYPE html>
<html>
<head>
    <title>Правила использования сервиса</title>
    <link rel="stylesheet" type="text/css" href="../styles/style.css">
    <link rel="stylesheet" type="text/css" href="../styles/rools.css">
    <link rel="shortcut icon" href="../img/bulletin_board.ico" type="image/x-icon">
</head>
<body>
    <?php if(!isset($_COOKIE['login'])): ?>
    <div id="categories">
        <div id="title"><b>Категории</b></div><br>
        <a href="auto_moto.php"><div class="categories"><p>Авто/мото</p></div></a>
        <a href="job.php"><div class="categories"><p>Вакансии</p></div></a>
        <a href="animals_plants.php"><div class="categories"><p>Животные и растения</p></div></a>
        <a href="property.php"><div class="categories"><p>Недвижимость</p></div></a>
        <a href="clothes.php"><div class="categories"><p>Одежда</p></div></a>
        <a href="service.php"><div class="categories"><p>Услуги</p></div></a>
        <a href="other.php"><div class="categories"><p>Другое</p></div></a>
    </div>

    <div id="content">
        <h1>Правила использования Сервиса</h1>
        <p class="rools">
            <ol>
                <li>
                    <strong>Условия использования Сервиса</strong>
                    <ol>
                        <li>
                            Пользователь обязан полностью ознакомиться с настоящими Правилами до момента начала использования Сервиса. Совершение Пользователем действий, направленных на использование Сервиса, означает полное и безоговорочное принятие Пользователем настоящих Правил.
                        </li>
                        <li>
                            Настоящие Правила могут быть изменены и/или дополнены в одностороннем порядке, если иное не предусмотрено применимым законодательством. Пользователь обязуется регулярно проверять условия настоящих Правил на предмет их изменения и/или дополнения.
                        </li>
                        <li>
                            В случае несогласия Пользователя с настоящими Правилами или его обновлениями Пользователь обязуется отказаться от использования Сервиса.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Регистрация на Сервисе</strong>
                    <ol>
                        <li>
                            Регистрация Пользователя на Сервисе является добровольной и бесплатной. Пользователь гарантирует, что он достиг возраста, допустимого в соответствии с законодательством Российской Федерации для акцепта настоящих Правил и обладает соответствующими полномочиями для использования функционала Сервиса.
                        </li>
                        <li>
                            При регистрации на Сервисе Пользователь обязан предоставить необходимую достоверную и актуальную информацию для формирования Личного кабинета Пользователя, включая уникальные для каждого Пользователя логин, номер телефона, адрес электронной почты, а также фамилию, имя и отчество.
                        </li>
                        <li>
                            Логин и пароль Пользователя являются необходимой и достаточной информацией для авторизации Пользователя и получения им полного доступа к Сервису.
                        </li>
                        <li>
                            Пользователь несет ответственность за достоверность, актуальность, полноту и соответствие законодательству Российской Федерации предоставленной при регистрации и далее в процессе использования Сервиса информации. Пользователь обязан своевременно актуализировать предоставленную им информацию.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Описание Сервиса</strong>
                    <ol>
                        Сервис предоставляет Пользователям площадку для размещения и просмотра Объявлений.
                        <li>
                            Пользователю предоставляется возможность размещения Объявлений на Сервисе (анонимно/не анонимно, адресно/без адреса), их изменения и удаления (в рамках настоящих Правил), просмотра Объявлений, изменения данных Личного кабинета при регистрации на Сервисе.
                        </li>
                        <li>
                            Пользователю предоставляется возможность просмотра Объявлений без регистрации на Сервисе.
                        </li>
                        <li>
                            При размещении Объявления происходит полуавтоматическая проверка его содержимого на наличие запрещенных слов. В случае, если Объявление не проходит проверку, оно не размещается и добавляется в архив.
                        </li>
                        <li>
                            По истечении срока в один месяц после размещения Объявление добавляется в архив и не доступно для ознакомления другими Пользователями.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Права и обязанности Пользователя</strong>
                    <ol>
                        <li>
                            Пользователь вправе при соблюдении настоящих Правил бесплатно использовать Сервис на условиях простой (неисключительной) лицензии для размещения и просмотра Объявлений.
                        </li>
                        <li>
                            Пользователь вправе использовать Сервис на всей территории Российской Федерации.
                        </li>
                        <li>
                            При размещении объявления Пользователю запрещается включать в него нецензурную лексику и высказывания, нарушающие законодательство Российской Федерации.
                        </li>
                        <li>
                            При использовании Сервиса Пользователь обязан:<br>
                            &#8226;&nbsp;соблюдать положения действующего законодательства Российской Федерации и настоящих Правил;<br>
                            &#8226;&nbsp;составлять название и текст Объявления на русском языке в соответствии с требованиями действующего законодательства Российской Федерации, за исключением международных и общеизвестных товарных знаков. При этом Пользователь вправе текст в Объявлении продублировать на ином языке, только если по содержанию такой текст полностью соответствует тексту на русском языке. Размещая Объявление на двух языках, Пользователь подтверждает аутентичность версий текстов Объявлений на русском и ином языках;<br>
                            &#8226;&nbsp;перед размещением любой информации на Сервисе, включая Объявления, предварительно оценивать законность их размещения;<br>
                            &#8226;&nbsp;размещать Объявления только о Товарах, в отношении которых Пользователь обладает достаточным объемом прав для распоряжения такими Товарами и совершения в отношении них сделок;<br>
                            &#8226;&nbsp;доводить до сведения Пользователей полную и исключительно достоверную информацию о свойствах Товаров и их характеристиках; Товары, указанные в Объявлении, должны соответствовать описанию, изложенному в данном Объявлении.<br>
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Права и обязанности Автора Сервиса</strong>
                    <ol>
                        <li>
                            Автор Сервиса осуществляет текущее управление Сервисом, самостоятельно определяет его структуру, внешний вид и иные элементы. Автор Сервиса сохраняет за собой право в любое время пересматривать или изменять оформление Сервиса, его функционал, изменять или дополнять используемые скрипты, программное обеспечение, используемые или хранящиеся в рамках Сервиса, и условия доступа Пользователей к ним.
                        </li>
                        <li>
                            Автор Сервиса также вправе по собственному усмотрению прекратить (временно или на постоянной основе) предоставление доступа к Сервису полностью либо в какой-либо части всем Пользователям в целом или отдельному Пользователю.
                        </li>
                        <li>
                            Автор Сервиса вправе без возмещения каких-либо затрат или убытков в любое время без уведомления Пользователя заблокировать Личный кабинет Пользователя либо удалить несоответствующие требованиям настоящих Правил Объявления.
                        </li>
                        <li>
                            Автор Сервиса вправе делать замечания Пользователям, предупреждать, уведомлять, информировать их о несоблюдении условий настоящих Правил.
                        </li>
                        <li>
                            Автор Сервиса вправе в любое время по своему усмотрению проводить выборочную проверку Объявлений на предмет соблюдения Пользователями настоящих Правил и соответствия их действующему законодательству Российской Федерации.
                        </li>
                        <li>
                            Автор Сервиса обязуется:<br>
                            &ndash;&nbsp;на условиях, изложенных в настоящих Правилах, предоставить Пользователю права на использование Сервиса на условиях простой (неисключительной) лицензии;<br>
                            &ndash;&nbsp;оказывать в разумные сроки техническую и информационную поддержку Пользователям, необходимую для получения доступа к Сервису и его последующего использования.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Гарантии, ответственность, принятие рисков Пользователями</strong>
                    <ol>
                        <li>
                            Использование Сервиса осуществляется Пользователями на свой страх и риск: Продавец самостоятельно на свой страх и риск размещает Объявления в отношении Товара, которым Продавец правомочен распоряжаться, а Покупатель рассматривает на свое усмотрение и под свою собственную ответственность Объявления Продавцов и принимает решение относительно заключения сделки с тем или иным Продавцом.
                        </li>
                        <li>
                            В случае наличия у Пользователя сомнений относительно законности осуществления тех или иных действий, в том числе связанных с размещением Объявлений, рекомендуется воздержаться от совершения последних.
                        </li>
                        <li>
                            Пользователь несет личную ответственность за любую информацию, Объявления и фотографии, которые размещает на сайте Сервиса, сообщает другим Пользователям, а также за любые взаимодействия с другими Пользователями, осуществляемые на свой риск.
                        </li>
                        <li>
                            Пользователь подтверждает, что действует на законных основаниях (например, по доверенности), обладает всеми необходимыми правами (в частности, для размещения Объявлений) и не нарушает своими действиями законные права и интересы третьих лиц и действующее законодательство Российской Федерации, в том числе законодательство о конкуренции и правах на результаты интеллектуальной деятельности и средства индивидуализации.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Ограничение ответственности Автора Сервиса</strong>
                    <ol>
                        <li>
                            Автор Сервиса не предоставляет никаких гарантий того, что Сервис или любые его элементы будут функционировать в любое конкретное время в будущем или что они не прекратят работу.
                        </li>
                        <li>
                            Автор Сервиса не несет ответственности за любой ущерб устройству или программному обеспечению Пользователя или иного лица, вызванный или связанный с использованием Сервиса не по вине Автора Сервиса, или при переходе по ссылкам, размещенным в рамках Сервиса третьими лицами.
                        </li>
                        <li>
                            Автор Сервиса не является стороной по сделкам, совершаемым между Покупателем и Продавцом, а также не является организатором, посредником, агентом или представителем какого-либо Пользователя и/или иным заинтересованным лицом в отношении предлагаемой/заключаемой между Пользователями сделки.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Условия об интеллектуальных правах</strong>
                    <ol>
                        <li>
                            Исключительные права на Сервис, включая, но не ограничиваясь на программы ЭВМ, базы данных, интерфейс, технические разработки, средства индивидуализации, используемые на Сервисе и позволяющие реализовывать функциональные возможности Сервиса, принадлежат Автору Сервиса.
                        </li>
                        <li>
                            В случае если информация (контент), размещаемая Пользователем, охраняется авторским правом, права на такую информацию сохраняются за Пользователем, разместившим такую информацию.
                        </li>
                    </ol>
                </li>
            </ol>
        </p>
    </div>

    <div id="right">
        <form action="../php/auth.php" method="post">
            <b>Авторизация на сайте</b>
            <br>
            <div class="field">
                <label for="inp_login">Логин:</label>
                <input id="inp_login" type="text" name="login">
            </div>
            <br>
            <div class="field">
                <label for="inp_pass">Пароль:</label>
                <input id="inp_pass" type="password" name="password">
            </div>
            <br>
            <button type="submit">Войти</button>
            <br>
            <a href="sign_up.php">Зарегистрироваться</a>
            <br>
        </form>
        <p>
            Правила использования сервиса
            <br>
            <a href="../index.php"><b>Главная страница</b></a>
            <br>
        </p>
    </div>

    <div id="footer">
        <p>Веб-приложение разработано в рамках курсовой работы по дисциплине &laquo;Разработка клиент-серверных приложений&raquo;.</p>
        <p>Автор: студент группы ИКБО-17-18 ИИТ РТУ МИРЭА Терентьев Дмитрий Константинович.</p>
    </div>

    <?php else: ?>
    <div id="categories">
        <div id="title"><b>Категории</b></div><br>
        <a href="auto_moto.php"><div class="categories"><p>Авто/мото</p></div></a>
        <a href="job.php"><div class="categories"><p>Вакансии</p></div></a>
        <a href="animals_plants.php"><div class="categories"><p>Животные и растения</p></div></a>
        <a href="property.php"><div class="categories"><p>Недвижимость</p></div></a>
        <a href="clothes.php"><div class="categories"><p>Одежда</p></div></a>
        <a href="service.php"><div class="categories"><p>Услуги</p></div></a>
        <a href="other.php"><div class="categories"><p>Другое</p></div></a>
    </div>

    <div id="content">
        <h1>Правила использования Сервиса</h1>
        <p class="rools">
            <ol>
                <li>
                    <strong>Условия использования Сервиса</strong>
                    <ol>
                        <li>
                            Пользователь обязан полностью ознакомиться с настоящими Правилами до момента начала использования Сервиса. Совершение Пользователем действий, направленных на использование Сервиса, означает полное и безоговорочное принятие Пользователем настоящих Правил.
                        </li>
                        <li>
                            Настоящие Правила могут быть изменены и/или дополнены в одностороннем порядке, если иное не предусмотрено применимым законодательством. Пользователь обязуется регулярно проверять условия настоящих Правил на предмет их изменения и/или дополнения.
                        </li>
                        <li>
                            В случае несогласия Пользователя с настоящими Правилами или его обновлениями Пользователь обязуется отказаться от использования Сервиса.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Регистрация на Сервисе</strong>
                    <ol>
                        <li>
                            Регистрация Пользователя на Сервисе является добровольной и бесплатной. Пользователь гарантирует, что он достиг возраста, допустимого в соответствии с законодательством Российской Федерации для акцепта настоящих Правил и обладает соответствующими полномочиями для использования функционала Сервиса.
                        </li>
                        <li>
                            При регистрации на Сервисе Пользователь обязан предоставить необходимую достоверную и актуальную информацию для формирования Личного кабинета Пользователя, включая уникальные для каждого Пользователя логин, номер телефона, адрес электронной почты, а также фамилию, имя и отчество.
                        </li>
                        <li>
                            Логин и пароль Пользователя являются необходимой и достаточной информацией для авторизации Пользователя и получения им полного доступа к Сервису.
                        </li>
                        <li>
                            Пользователь несет ответственность за достоверность, актуальность, полноту и соответствие законодательству Российской Федерации предоставленной при регистрации и далее в процессе использования Сервиса информации. Пользователь обязан своевременно актуализировать предоставленную им информацию.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Описание Сервиса</strong>
                    <ol>
                        Сервис предоставляет Пользователям площадку для размещения и просмотра Объявлений.
                        <li>
                            Пользователю предоставляется возможность размещения Объявлений на Сервисе (анонимно/не анонимно, адресно/без адреса), их изменения и удаления (в рамках настоящих Правил), просмотра Объявлений, изменения данных Личного кабинета при регистрации на Сервисе.
                        </li>
                        <li>
                            Пользователю предоставляется возможность просмотра Объявлений без регистрации на Сервисе.
                        </li>
                        <li>
                            При размещении Объявления происходит полуавтоматическая проверка его содержимого на наличие запрещенных слов. В случае, если Объявление не проходит проверку, оно не размещается и добавляется в архив.
                        </li>
                        <li>
                            По истечении срока в один месяц после размещения Объявление добавляется в архив и не доступно для ознакомления другими Пользователями.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Права и обязанности Пользователя</strong>
                    <ol>
                        <li>
                            Пользователь вправе при соблюдении настоящих Правил бесплатно использовать Сервис на условиях простой (неисключительной) лицензии для размещения и просмотра Объявлений.
                        </li>
                        <li>
                            Пользователь вправе использовать Сервис на всей территории Российской Федерации.
                        </li>
                        <li>
                            При размещении объявления Пользователю запрещается включать в него нецензурную лексику и высказывания, нарушающие законодательство Российской Федерации.
                        </li>
                        <li>
                            При использовании Сервиса Пользователь обязан:<br>
                            &#8226;&nbsp;соблюдать положения действующего законодательства Российской Федерации и настоящих Правил;<br>
                            &#8226;&nbsp;составлять название и текст Объявления на русском языке в соответствии с требованиями действующего законодательства Российской Федерации, за исключением международных и общеизвестных товарных знаков. При этом Пользователь вправе текст в Объявлении продублировать на ином языке, только если по содержанию такой текст полностью соответствует тексту на русском языке. Размещая Объявление на двух языках, Пользователь подтверждает аутентичность версий текстов Объявлений на русском и ином языках;<br>
                            &#8226;&nbsp;перед размещением любой информации на Сервисе, включая Объявления, предварительно оценивать законность их размещения;<br>
                            &#8226;&nbsp;размещать Объявления только о Товарах, в отношении которых Пользователь обладает достаточным объемом прав для распоряжения такими Товарами и совершения в отношении них сделок;<br>
                            &#8226;&nbsp;доводить до сведения Пользователей полную и исключительно достоверную информацию о свойствах Товаров и их характеристиках; Товары, указанные в Объявлении, должны соответствовать описанию, изложенному в данном Объявлении.<br>
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Права и обязанности Автора Сервиса</strong>
                    <ol>
                        <li>
                            Автор Сервиса осуществляет текущее управление Сервисом, самостоятельно определяет его структуру, внешний вид и иные элементы. Автор Сервиса сохраняет за собой право в любое время пересматривать или изменять оформление Сервиса, его функционал, изменять или дополнять используемые скрипты, программное обеспечение, используемые или хранящиеся в рамках Сервиса, и условия доступа Пользователей к ним.
                        </li>
                        <li>
                            Автор Сервиса также вправе по собственному усмотрению прекратить (временно или на постоянной основе) предоставление доступа к Сервису полностью либо в какой-либо части всем Пользователям в целом или отдельному Пользователю.
                        </li>
                        <li>
                            Автор Сервиса вправе без возмещения каких-либо затрат или убытков в любое время без уведомления Пользователя заблокировать Личный кабинет Пользователя либо удалить несоответствующие требованиям настоящих Правил Объявления.
                        </li>
                        <li>
                            Автор Сервиса вправе делать замечания Пользователям, предупреждать, уведомлять, информировать их о несоблюдении условий настоящих Правил.
                        </li>
                        <li>
                            Автор Сервиса вправе в любое время по своему усмотрению проводить выборочную проверку Объявлений на предмет соблюдения Пользователями настоящих Правил и соответствия их действующему законодательству Российской Федерации.
                        </li>
                        <li>
                            Автор Сервиса обязуется:<br>
                            &ndash;&nbsp;на условиях, изложенных в настоящих Правилах, предоставить Пользователю права на использование Сервиса на условиях простой (неисключительной) лицензии;<br>
                            &ndash;&nbsp;оказывать в разумные сроки техническую и информационную поддержку Пользователям, необходимую для получения доступа к Сервису и его последующего использования.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Гарантии, ответственность, принятие рисков Пользователями</strong>
                    <ol>
                        <li>
                            Использование Сервиса осуществляется Пользователями на свой страх и риск: Продавец самостоятельно на свой страх и риск размещает Объявления в отношении Товара, которым Продавец правомочен распоряжаться, а Покупатель рассматривает на свое усмотрение и под свою собственную ответственность Объявления Продавцов и принимает решение относительно заключения сделки с тем или иным Продавцом.
                        </li>
                        <li>
                            В случае наличия у Пользователя сомнений относительно законности осуществления тех или иных действий, в том числе связанных с размещением Объявлений, рекомендуется воздержаться от совершения последних.
                        </li>
                        <li>
                            Пользователь несет личную ответственность за любую информацию, Объявления и фотографии, которые размещает на сайте Сервиса, сообщает другим Пользователям, а также за любые взаимодействия с другими Пользователями, осуществляемые на свой риск.
                        </li>
                        <li>
                            Пользователь подтверждает, что действует на законных основаниях (например, по доверенности), обладает всеми необходимыми правами (в частности, для размещения Объявлений) и не нарушает своими действиями законные права и интересы третьих лиц и действующее законодательство Российской Федерации, в том числе законодательство о конкуренции и правах на результаты интеллектуальной деятельности и средства индивидуализации.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Ограничение ответственности Автора Сервиса</strong>
                    <ol>
                        <li>
                            Автор Сервиса не предоставляет никаких гарантий того, что Сервис или любые его элементы будут функционировать в любое конкретное время в будущем или что они не прекратят работу.
                        </li>
                        <li>
                            Автор Сервиса не несет ответственности за любой ущерб устройству или программному обеспечению Пользователя или иного лица, вызванный или связанный с использованием Сервиса не по вине Автора Сервиса, или при переходе по ссылкам, размещенным в рамках Сервиса третьими лицами.
                        </li>
                        <li>
                            Автор Сервиса не является стороной по сделкам, совершаемым между Покупателем и Продавцом, а также не является организатором, посредником, агентом или представителем какого-либо Пользователя и/или иным заинтересованным лицом в отношении предлагаемой/заключаемой между Пользователями сделки.
                        </li>
                    </ol>
                </li>
                <br>
                <li>
                    <strong>Условия об интеллектуальных правах</strong>
                    <ol>
                        <li>
                            Исключительные права на Сервис, включая, но не ограничиваясь на программы ЭВМ, базы данных, интерфейс, технические разработки, средства индивидуализации, используемые на Сервисе и позволяющие реализовывать функциональные возможности Сервиса, принадлежат Автору Сервиса.
                        </li>
                        <li>
                            В случае если информация (контент), размещаемая Пользователем, охраняется авторским правом, права на такую информацию сохраняются за Пользователем, разместившим такую информацию.
                        </li>
                    </ol>
                </li>
            </ol>
        </p>
    </div>

    <div id="right">
        <p>
            Вы авторизованы как <b><?=$_COOKIE['login']?></b>
            <br>
            <br>
            <a href="cabinet.php">Личный кабинет</a>
            <br>
            <a href="my_ads.php">Мои объявления</a>
            <br>
            <a href="archive.php">Архив объявлений</a>
            <br>
            Правила использования сервиса
            <br>
            <a href="../index.php"><b>Главная страница</b></a>
            <br>
            <a href="../php/exit.php">Выход</a>
        </p>
        <a href="create_ad.php"><button id="add_advert">Разместить объявление</button></a><br>
    </div>

    <div id="footer">
        <p>Веб-приложение разработано в рамках курсовой работы по дисциплине &laquo;Разработка клиент-серверных приложений&raquo;.</p>
        <p>Автор: студент группы ИКБО-17-18 ИИТ РТУ МИРЭА Терентьев Дмитрий Константинович.</p>
    </div>        
    
    <?php endif;?>
</body>
</html>